{
  "subreddit": "datascience",
  "collected_at": "2025-10-04T13:27:23.193335",
  "count": 15,
  "posts": [
    {
      "id": "1nxrrcw",
      "title": "What could be my next career progression?",
      "selftext": "Hello, I'm 26 years old been working as a junior data scientist in marketing for the past two years and I'm a bit bored/ have no idea how to progress further in my career.\n\nCurrently I do end to end modeling, from gathering data up to production (not in the most data sciency way since I'm very limited in terms of tools but my models are being effectively used by other departments). \n\nI have built 5 different models: propensity score models, customer segmentation, churn models and a time series forecasting model.\n\nAll my job has been revolving around developing, validating, monitoring and updating these models I have built with the current tools I have available.\n\nI realise I'm already privileged in terms of what I'm doing. It's my first job and already developing models end to end in a company that recognises their usefulness and I'm pretty much free to take any decision about them.\n\nHowever, I would love to advance further since the my job is starting to get a bit repetitive.\nIn terms of innovating further my workflow I realised it's actually pretty much impossible. The company IT is stagnant and any time I asked for anything, like introducing MlFlow in my sagemaker flow (YES, from development to \"production\" is done in sagemaker using notebooks. I understand and have faced many of the problems that come out of this) or Airflow or anything else, the request has never gotten anywhere.\nThe size of the company and the IT privileges setup makes it impossible for me to take the innovation in my own hands and do as I please. I've tried lots of technical workarounds and loopholes but not very successfully.\n\n\nI don't feel confident enough now take a more senior position, nor there is the possibility at my current job. My boss is not directly involved in modeling stuff and don't really have anyone I can go to with career progression questions.\n\nI feel like I kinda already reached the end of progression and I'm pretty much lost in terms of what I can do, other than ask for various tools to make the pipeline up to current standards (which will not have an impact in terms of how the output will be used by other departments and profits).\n\nI understand it's an open ended question, but what else could I do to advance?",
      "author": "Gaston154",
      "subreddit": "datascience",
      "created_utc": "2025-10-04T12:43:06",
      "score": 4,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "permalink": "/r/datascience/comments/1nxrrcw/what_could_be_my_next_career_progression/",
      "url": "https://www.reddit.com/r/datascience/comments/1nxrrcw/what_could_be_my_next_career_progression/",
      "is_self": true,
      "link_flair_text": "Discussion",
      "retrieved_at": "2025-10-04T13:27:22.904958",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nxqln5",
      "title": "Do you know interesting datasets for kriging?",
      "selftext": "Hi guys, I need to do a project using many linear models and I’m looking for a dataset. Ideally something interesting with lots of numerical variables, especially one where kriging could be applied.\n\nIf you have any dataset suggestions or interesting research questions I could build the project around, I’d really appreciate it. Thanks a lot!\n\nPS: i did not like chatgpt suggestions, they were cliche (even if i explicitly asked “not cliche”)",
      "author": "FinalRide7181",
      "subreddit": "datascience",
      "created_utc": "2025-10-04T11:38:16",
      "score": 2,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "permalink": "/r/datascience/comments/1nxqln5/do_you_know_interesting_datasets_for_kriging/",
      "url": "https://www.reddit.com/r/datascience/comments/1nxqln5/do_you_know_interesting_datasets_for_kriging/",
      "is_self": true,
      "link_flair_text": "Projects",
      "retrieved_at": "2025-10-04T13:27:22.904996",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nwh00i",
      "title": "Are LLMs necessary to get a job?",
      "selftext": "For someone laid off in 2023 before the LLM/Agent craze went mainstream, do you think I need to learn LLM architecture? Are certs or github projects worth anything as far as getting through the filters and/or landing a job?  \n\nI have 10 YOE. I specialized in machine learning at the start, but the last 5 years of employment, I was at a FAANG company and didnt directly own any ML stuff. It seems \"traditional\" ML demand, especially without LLM knowledge, is almost zero. I've had some interviews for roles focused on experimentation, but no offers.    \nI can't tell whether my previous experience is irrelevant now. I deployed \"deep\" learning pipelines with basic MLOps. I did a lot of predictive analytics, segmentation, and data exploration with ML.  \n\nI understand the landscape and tech OK, but it seems like every job description now says you need direct experience with agentic frameworks, developing/optimizing/tuning LLMs, and using orchestration frameworks or advanced MLOps. I don't see how DS could have changed enough in two years that every candidate has on-the-job experience with this now.  \n\nIt seems like actually getting confident with the full stack/architecture would take a 6 month course or cert. Ive tried shorter trainings and free content... and it seems like everyone is just learning \"prompt engineering,\" basic RAG with agents, and building chatbots without investigating the underlying architecture at all.  \n\nAre the job descriptions misrepresenting the level of skill needed or am I just out of the loop?",
      "author": "br0monium",
      "subreddit": "datascience",
      "created_utc": "2025-10-02T22:43:00",
      "score": 64,
      "upvote_ratio": 0.8,
      "num_comments": 57,
      "permalink": "/r/datascience/comments/1nwh00i/are_llms_necessary_to_get_a_job/",
      "url": "https://www.reddit.com/r/datascience/comments/1nwh00i/are_llms_necessary_to_get_a_job/",
      "is_self": true,
      "link_flair_text": "Career | US",
      "retrieved_at": "2025-10-04T13:27:22.905005",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nvduc2",
      "title": "Fun Interview with Jason Strimpel about transferable skills from data science to algorithmic trading.",
      "selftext": "I had the opportunity to interview Jason Strimpel.  He's been in trading and technology for 25 years as a hedge fund trader, risk quant, machine learning engineering manager, and GenAI specialist at AWS. He is now the Managing Director of AI and Advanced Analytics at a major consulting company. \n\nI asked him all about the transferable skills, the mindset shifts, tools someone should pick up if they're just getting started, how algo trading is similar to ML, and differences in how you think about/work with the data. He had a lot of great tips if you're a data person thinking about getting into trading.",
      "author": "Clicketrie",
      "subreddit": "datascience",
      "created_utc": "2025-10-01T18:00:56",
      "score": 16,
      "upvote_ratio": 0.77,
      "num_comments": 2,
      "permalink": "/r/datascience/comments/1nvduc2/fun_interview_with_jason_strimpel_about/",
      "url": "https://www.datamovesme.com/blog/qfe2cds9h37bdmvi8h4a7p0x785ic9",
      "is_self": false,
      "link_flair_text": "Discussion",
      "retrieved_at": "2025-10-04T13:27:22.905013",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nv7767",
      "title": "Context Engineering: Improving AI Coding agents using DSPy GEPA",
      "selftext": "",
      "author": "phicreative1997",
      "subreddit": "datascience",
      "created_utc": "2025-10-01T13:44:56",
      "score": 1,
      "upvote_ratio": 0.6,
      "num_comments": 2,
      "permalink": "/r/datascience/comments/1nv7767/context_engineering_improving_ai_coding_agents/",
      "url": "https://www.firebird-technologies.com/p/context-engineering-improving-ai",
      "is_self": false,
      "link_flair_text": "Projects",
      "retrieved_at": "2025-10-04T13:27:22.905024",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nv6wv8",
      "title": "GLM 4.6 is the BEST CODING LLM. Period.",
      "selftext": "Honestly, GLM 4.6 might be my favorite LLM right now. I threw it a messy, real-world coding project, full front-end build, 20+ components, custom data transformations, and a bunch of steps that normally require me to constantly keep track of what’s happening. With older models like GLM 4.5 and even the latest Claude 4.5 Sonnet, I’d be juggling context limits, cleaning up messy outputs, and basically babysitting the process.\n\nGLM 4.6? It handled everything smoothly. Remembered the full context, generated clean code, even suggested little improvements I hadn’t thought of. Multi-step workflows that normally get confusing were just… done. And it did all that using fewer tokens than 4.5, so it’s faster and cheaper too.\n\nLoved the new release [Z.ai](http://Z.ai)",
      "author": "Technical-Love-8479",
      "subreddit": "datascience",
      "created_utc": "2025-10-01T13:32:02",
      "score": 0,
      "upvote_ratio": 0.06,
      "num_comments": 6,
      "permalink": "/r/datascience/comments/1nv6wv8/glm_46_is_the_best_coding_llm_period/",
      "url": "https://www.reddit.com/r/datascience/comments/1nv6wv8/glm_46_is_the_best_coding_llm_period/",
      "is_self": true,
      "link_flair_text": "AI",
      "retrieved_at": "2025-10-04T13:27:22.905060",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nv4wdg",
      "title": "How to make the most out free time at a big tech company?",
      "selftext": "I recently started working at FAANG as a DS. We have a very chill team and workload is pretty relaxed. The work itself is not the most interesting (basically a cog in the machine type role) but the pay and people are good so I'm staying for now. \n\nHow have you guys used the resources that huge companies have to find interesting work to do when your day to day is limited. I know of some personal projects I could do, but I was more interested in if its possible to somehow leverage my companies resources to make the project more interesting. Has anyone else done something similar, any ideas or motivation would be appreciated.",
      "author": "LeaguePrototype",
      "subreddit": "datascience",
      "created_utc": "2025-10-01T11:49:05",
      "score": 142,
      "upvote_ratio": 0.92,
      "num_comments": 34,
      "permalink": "/r/datascience/comments/1nv4wdg/how_to_make_the_most_out_free_time_at_a_big_tech/",
      "url": "https://www.reddit.com/r/datascience/comments/1nv4wdg/how_to_make_the_most_out_free_time_at_a_big_tech/",
      "is_self": true,
      "link_flair_text": "Projects",
      "retrieved_at": "2025-10-04T13:27:22.905069",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nv0lfh",
      "title": "For data scientists in insurance and banking, how many data scientists/ML engineers work in your company, how are their teams organised, and roughly what do they work on?",
      "selftext": "I'm trying to get a better sense of how this is developing in financial services. Anything from insurance/banking or adjacent fields would be most appreciated.",
      "author": "geebr",
      "subreddit": "datascience",
      "created_utc": "2025-10-01T07:10:41",
      "score": 47,
      "upvote_ratio": 0.89,
      "num_comments": 25,
      "permalink": "/r/datascience/comments/1nv0lfh/for_data_scientists_in_insurance_and_banking_how/",
      "url": "https://www.reddit.com/r/datascience/comments/1nv0lfh/for_data_scientists_in_insurance_and_banking_how/",
      "is_self": true,
      "link_flair_text": "Discussion",
      "retrieved_at": "2025-10-04T13:27:22.905077",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nurg0y",
      "title": "Distance Correlation & Matrix Association. Good stuff?",
      "selftext": "",
      "author": "uSeeEsBee",
      "subreddit": "datascience",
      "created_utc": "2025-09-30T23:35:09",
      "score": 4,
      "upvote_ratio": 0.75,
      "num_comments": 0,
      "permalink": "/r/datascience/comments/1nurg0y/distance_correlation_matrix_association_good_stuff/",
      "url": "/r/AskStatistics/comments/1nurfk1/distance_correlation_matrix_association_good_stuff/",
      "is_self": false,
      "link_flair_text": "Discussion",
      "retrieved_at": "2025-10-04T13:27:22.905084",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nucvgd",
      "title": "Weekend Project - Poker Agents Video/Code",
      "selftext": "Fun side project. You can configure (almost) any LLM as a player. The main capabilities (tools) each agent can call are:\n\n1) Hand Analysis\nGet detailed info about current hand and possibilities (straight draws, flush potential, many other things)\n\n2) Monte Carlo\nGet an estimated win probability if the player continues in the hand (can only be called one time per hand)\n\n3) Opponent Statistics\nGet metrics about opponent behavior, specifically how aggressive or passively they’ve played\n\nIt’s not a completely novel - other people have made LLMs play poker. The configurability and the specific callable tools are, to my knowledge, unique. Using it requires an OpenRouter API key.\n\n\nVideo:\nhttps://youtu.be/1PDo6-tcWfE?si=WR-vgYtmlksKCAm4\n\nCode:\nhttps://github.com/OlivierNDO/llm_poker_agents\n\n",
      "author": "MLEngDelivers",
      "subreddit": "datascience",
      "created_utc": "2025-09-30T14:13:57",
      "score": 55,
      "upvote_ratio": 0.92,
      "num_comments": 14,
      "permalink": "/r/datascience/comments/1nucvgd/weekend_project_poker_agents_videocode/",
      "url": "https://i.redd.it/hqdrczgwxasf1.jpeg",
      "is_self": false,
      "link_flair_text": "Projects",
      "retrieved_at": "2025-10-04T13:27:22.905091",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1ntmrix",
      "title": "This has to be bait right?",
      "selftext": "recruitment companies posting jobs like this are just setting bait to get resumes so they can push other jobs right?",
      "author": "ds_throw",
      "subreddit": "datascience",
      "created_utc": "2025-09-29T17:31:52",
      "score": 180,
      "upvote_ratio": 0.84,
      "num_comments": 46,
      "permalink": "/r/datascience/comments/1ntmrix/this_has_to_be_bait_right/",
      "url": "https://i.redd.it/o7gh03w4s4sf1.jpeg",
      "is_self": false,
      "link_flair_text": "Discussion",
      "retrieved_at": "2025-10-04T13:27:22.905099",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1ntlgy5",
      "title": "Career advice",
      "selftext": "Hi everyone,\n\nI think I need a little general guidance on how to move forward.  After working in retail for 11 years, I went back to school in 2020 to do a Bachelor’s in Mathematics and a masters in analytics.  I was hoping to become a data scientist upon graduating.  Obviously, market conditions have fluctuated substantially since I started.  \n\nI took a job as a materials planner in electronics manufacturing, with the expectation that my boss was looking for someone that was data minded and would primarily focus on building pipelines and tools to make things run more smoothly.   my planning duties would be small while I used my skills to automate and streamline workflows.  Up to this point, my job has been about 70 percent coding and “data engineering/analyzing”, 20 percent managing and organizing my projects, and 10 percent actual materials planning.\n\nI think my boss made a risky hire.  He’s not an IT person, and has not been able to move the needle on giving me the access I need to scale these processes.  I found an old reporting tool that is basically SQL that nobody uses: have been able to install VS code on my work laptop, so I have been able to  substantially streamline, dashboard, and improve a ton of stuff using Python, “SQL”, and PowerQuery.\n\nThey pulled my access to the reporting tool: no advance communication.  All of my projects are pretty much kaput.  I feel like I’ve been lowballed big time.  I’m glad to have a job right now, but also I’m in a bit of a predicament.  If my job search went on for another 6 months, most employers in actual “data” roles would understand the struggle: and I might even have an actual role in data analytics right now, if I got lucky.  But now I am in a position that is a huge departure from what was discussed.  No matter the situation, leaving after only 6 months would look terrible one me.  It seems like the best thing to do is ride it out, but I’m not sure or for how long I should. ",
      "author": "rmb91896",
      "subreddit": "datascience",
      "created_utc": "2025-09-29T16:43:04",
      "score": 25,
      "upvote_ratio": 0.9,
      "num_comments": 8,
      "permalink": "/r/datascience/comments/1ntlgy5/career_advice/",
      "url": "https://www.reddit.com/r/datascience/comments/1ntlgy5/career_advice/",
      "is_self": true,
      "link_flair_text": "Career | US",
      "retrieved_at": "2025-10-04T13:27:22.905105",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nt8wl0",
      "title": "What a Drunk Man Can Teach Us About Time Series Forecasting",
      "selftext": "**Autocorrelation & The Random Walk explained** with a drunk man 🍺\n\nLet me illustrate this statistical concept with an example we can all visualize.\n\nImagine a drunk man wandering a city. His steps are completely random and unpredictable.\n\n**Here's the intuition**:\n\n\\- His current position is completely tied to his previous position\n\n\\- We know where he is RIGHT NOW, but have no idea where he'll be in the next minute\n\n**The statistical insight**:\n\nIn a random walk, the *current position* is highly correlated with the *previous position*, but the *changes in position* (the steps) are completely random & uncorrelated.\n\n\n\nThis is why random walks are so tricky to forecast!\n\n[Part 2: Time Series Forecasting: Build a Baseline & Understand the Random Walk](https://youtu.be/_Ke54TJqY9s) \n\n  \nWould love to hear your **thoughts, feedback** about this topic",
      "author": "The_Simpsons_22",
      "subreddit": "datascience",
      "created_utc": "2025-09-29T05:31:25",
      "score": 59,
      "upvote_ratio": 0.78,
      "num_comments": 9,
      "permalink": "/r/datascience/comments/1nt8wl0/what_a_drunk_man_can_teach_us_about_time_series/",
      "url": "https://www.reddit.com/r/datascience/comments/1nt8wl0/what_a_drunk_man_can_teach_us_about_time_series/",
      "is_self": true,
      "link_flair_text": "Education",
      "retrieved_at": "2025-10-04T13:27:22.905112",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nt8d65",
      "title": "Weekly Entering & Transitioning - Thread 29 Sep, 2025 - 06 Oct, 2025",
      "selftext": " \n\nWelcome to this week's entering & transitioning thread! This thread is for any questions about getting started, studying, or transitioning into the data science field. Topics include:\n\n* Learning resources (e.g. books, tutorials, videos)\n* Traditional education (e.g. schools, degrees, electives)\n* Alternative education (e.g. online courses, bootcamps)\n* Job search questions (e.g. resumes, applying, career prospects)\n* Elementary questions (e.g. where to start, what next)\n\nWhile you wait for answers from the community, check out the [FAQ](https://www.reddit.com/r/datascience/wiki/frequently-asked-questions) and Resources pages on our wiki. You can also search for answers in [past weekly threads](https://www.reddit.com/r/datascience/search?q=weekly%20thread&restrict_sr=1&sort=new).",
      "author": "AutoModerator",
      "subreddit": "datascience",
      "created_utc": "2025-09-29T05:01:23",
      "score": 6,
      "upvote_ratio": 0.81,
      "num_comments": 13,
      "permalink": "/r/datascience/comments/1nt8d65/weekly_entering_transitioning_thread_29_sep_2025/",
      "url": "https://www.reddit.com/r/datascience/comments/1nt8d65/weekly_entering_transitioning_thread_29_sep_2025/",
      "is_self": true,
      "link_flair_text": null,
      "retrieved_at": "2025-10-04T13:27:22.905119",
      "is_video": false,
      "over_18": false
    },
    {
      "id": "1nt6q59",
      "title": "What interesting projects are you working on that are not related to AI?",
      "selftext": "Share links if possible.",
      "author": "yaymayhun",
      "subreddit": "datascience",
      "created_utc": "2025-09-29T03:34:24",
      "score": 44,
      "upvote_ratio": 0.96,
      "num_comments": 38,
      "permalink": "/r/datascience/comments/1nt6q59/what_interesting_projects_are_you_working_on_that/",
      "url": "https://www.reddit.com/r/datascience/comments/1nt6q59/what_interesting_projects_are_you_working_on_that/",
      "is_self": true,
      "link_flair_text": "Projects",
      "retrieved_at": "2025-10-04T13:27:22.905126",
      "is_video": false,
      "over_18": false
    }
  ]
}