{
  "id": "1kus0i1",
  "title": "Machine Learning Needs to be Reworked",
  "selftext": "EDIT:\n\nTo provide some additional framing and get across the vibe better : this is perhaps one of the most taken graduate machine learning classes in the world. It’s delivered online and can be continuously refined. Shouldn’t it listen to feedback, keep up with the field, continuously improve, serve as the gold standard for teaching machine learning, and singularly attract people to the program for its quality and rigor? Machine learning is one of the hottest topics and areas of interest in computer science / the general public, and I feel like we should seize on this energy and channel it into something great. \n\n*grabs a pitchfork, sees the raised eyebrows, slowly sets it down… picks up a dry erase marker and turns to a whiteboard* \n\nOriginal post below:\n\n7641 needs to be reworked. \n\nAs a foundational class for this program, I’m disappointed by the quality of / effort by the staff. If any of these points existed in isolation, it wouldn't be an issue. But the combination of them I think can lead one to reasonably have concerns about the quality of the course. The individual points are debatable.\n\n1. The textbook is nearly 30 years old. This is not necessarily bad in itself, but when combined with the old lectures it feels like the course just hasn't been refreshed.\n2. The lectures are extremely high level and more appropriate for a non technical audience (like a MOOC) rather than a graduate level machine learning class. There are several topics that are important to machine learning that are missing from the lectures (regression, classification, cross-validation, practical information about model selection, etc) and several topics that are overemphasized (learning theory / VC dimensions, information theory).\n3. The assignments are extremely low effort by staff. The instructions to the assignments are vague and require multiple addendums by staff and countless FAQs. There were ~100 EdX posts asking clarifying questions for the first assignment. Rather than update the assignment description and give all the information you need up front, they make it a scavenger hunt to figure out the requirements across random EdX posts and OHs. They used a synthetic datasets that is of embarrassing quality and tried to gas light the students into thinking it was interesting when in fact they just hadn't spent time assessing the quality of the dataset. The report based assignments are so underspecified and the backgrounds of students are so diverse that the assignments have wildly different levels of quality. \"Explore something interesting!\" they tell us -- then give us a synthetic dataset with uniformly distributed variables, no correspondence to reality (50% of prostate cancer patients are women) and a target that has 100% R^2 with a linear model. \n4. The quizzes emphasize a number of topics that were marked \"optional\" on the syllabus. The staff released a practice quiz and then didn't send out all of the answers until 2 days prior to when the quiz was due (so if you wanted to know the answers before attempting the quiz, you'd need to work on the weekend). \n5. There are errors in the syllabus, the canvas is poorly organized, the staff continues to send emails from prior semesters with faulty dates / descriptions of assignments. The TAs are highly variable in quality. Many important questions on the forums are answered by a small number of that are variably correct.\n\nThis should be one of the flagship courses for OMSCS, and instead it feels like an udemy class from the early 2000s. \n\nCriticism is a little harsh, but I want to improve the quality of the program, and I’ve noticed many similar issues with other courses I’ve taken. \n\n",
  "author": "Loud_Pomegranate_749",
  "subreddit": "OMSCS",
  "created_utc": "2025-05-25T03:26:04",
  "score": 114,
  "upvote_ratio": 0.86,
  "num_comments": 123,
  "permalink": "/r/OMSCS/comments/1kus0i1/machine_learning_needs_to_be_reworked/",
  "url": "https://www.reddit.com/r/OMSCS/comments/1kus0i1/machine_learning_needs_to_be_reworked/",
  "is_self": true,
  "link_flair_text": "CS 7641 ML",
  "retrieved_at": "2025-10-04T21:23:12.611648"
}