{
  "id": "1np6k4c",
  "title": "Data Science grad here. IT job market is cooked. Thinking of pivoting to finance - am I screwed?",
  "selftext": "Data Science grad here. IT job market is cooked. Thinking of pivoting to finance - am I screwed?\n\nAlright, gonna keep it 100. I just finished my Masters in Data Science and the job search is brutal. The entry-level tech market is a bloodbath. Getting ghosted left and right.\n\nSo I'm thinking of saying screw it and trying my luck in finance. I've got the hard stats and Python skills, but my finance knowledge is basically zero. I know I'm not a finance bro, but can I even get a foot in the door?\n\nI need the straight truth. No sugar-coating.\n\nFrom what I've scraped together, here's the deal. Tell me if I'm on the right track or completely delusional.\n\nThe Gap I Need to Fill:\n\n· Finance 101: I need to learn the basics—like, what even is a DCF? Corporate finance, how markets work, all that jargon.\n· Applying my skills: How to use my Python/ML skills on financial data. Time series, forecasting, all that good stuff.\n· The hard stuff: The scary math that proper quants use.\n\nCerts? Worth it or a waste of time?\n\n· CFA: Looks like a hellish 3-level marathon. Is this a must-have to get past HR?\n· FRM: Seems more focused on risk. Maybe a faster option?\n· FMVA: Heard it's good for the practical, Excel-modeling side of things.\n\nMy real questions:\n\n· Is my Data Science degree actually a plus, or will they just toss my resume for not having \"Finance\" on it?\n· Am I just jumping from one sinking ship to another? Is finance any better right now?\n· Should I just grind out a few killer finance projects (like building a trading bot or a risk model) to prove I'm not clueless?\n\nI'm ready to put in the work. I just need to know if this is a viable path or if I'm setting myself up for another year of disappointment. What's the fastest way to stop being unemployed?\n",
  "author": "iakgk",
  "subreddit": "careerguidance",
  "created_utc": "2025-09-24T09:15:48",
  "score": 8,
  "upvote_ratio": 0.66,
  "num_comments": 58,
  "permalink": "/r/careerguidance/comments/1np6k4c/data_science_grad_here_it_job_market_is_cooked/",
  "url": "https://www.reddit.com/r/careerguidance/comments/1np6k4c/data_science_grad_here_it_job_market_is_cooked/",
  "is_self": true,
  "link_flair_text": "Advice",
  "retrieved_at": "2025-10-04T13:26:09.128500"
}