{
  "id": "1ntlgy5",
  "title": "Career advice",
  "selftext": "Hi everyone,\n\nI think I need a little general guidance on how to move forward.  After working in retail for 11 years, I went back to school in 2020 to do a Bachelor’s in Mathematics and a masters in analytics.  I was hoping to become a data scientist upon graduating.  Obviously, market conditions have fluctuated substantially since I started.  \n\nI took a job as a materials planner in electronics manufacturing, with the expectation that my boss was looking for someone that was data minded and would primarily focus on building pipelines and tools to make things run more smoothly.   my planning duties would be small while I used my skills to automate and streamline workflows.  Up to this point, my job has been about 70 percent coding and “data engineering/analyzing”, 20 percent managing and organizing my projects, and 10 percent actual materials planning.\n\nI think my boss made a risky hire.  He’s not an IT person, and has not been able to move the needle on giving me the access I need to scale these processes.  I found an old reporting tool that is basically SQL that nobody uses: have been able to install VS code on my work laptop, so I have been able to  substantially streamline, dashboard, and improve a ton of stuff using Python, “SQL”, and PowerQuery.\n\nThey pulled my access to the reporting tool: no advance communication.  All of my projects are pretty much kaput.  I feel like I’ve been lowballed big time.  I’m glad to have a job right now, but also I’m in a bit of a predicament.  If my job search went on for another 6 months, most employers in actual “data” roles would understand the struggle: and I might even have an actual role in data analytics right now, if I got lucky.  But now I am in a position that is a huge departure from what was discussed.  No matter the situation, leaving after only 6 months would look terrible one me.  It seems like the best thing to do is ride it out, but I’m not sure or for how long I should. ",
  "author": "rmb91896",
  "subreddit": "datascience",
  "created_utc": "2025-09-29T16:43:04",
  "score": 25,
  "upvote_ratio": 0.9,
  "num_comments": 8,
  "permalink": "/r/datascience/comments/1ntlgy5/career_advice/",
  "url": "https://www.reddit.com/r/datascience/comments/1ntlgy5/career_advice/",
  "is_self": true,
  "link_flair_text": "Career | US",
  "retrieved_at": "2025-10-04T13:27:22.905105",
  "is_video": false,
  "over_18": false
}